Terraform Plan for `Directory: edge` and `Workspace: default`:

```
[command]/home/runner/work/_temp/08a3e56d-f087-4b1e-9bb7-404291ec6996/terraform-bin plan -no-color -out=tfplan
aws_security_group.example: Refreshing state... [id=sg-0954367191803e0a8]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_security_group.example must be replaced
-/+ resource "aws_security_group" "example" {
      ~ arn                    = "arn:aws:ec2:us-east-1:788932519567:security-group/sg-0954367191803e0a8" -> (known after apply)
      ~ id                     = "sg-0954367191803e0a8" -> (known after apply)
      ~ name                   = "terra-security-group" -> "edge-terra-security-group" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "788932519567" -> (known after apply)
        tags                   = {
            "Name" = "example-security-group"
        }
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ security_group_id = "sg-0954367191803e0a8" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
::debug::Terraform exited with code 0.
::debug::stdout: aws_security_group.example: Refreshing state... [id=sg-0954367191803e0a8]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # aws_security_group.example must be replaced%0A-/+ resource "aws_security_group" "example" {%0A      ~ arn                    = "arn:aws:ec2:us-east-1:788932519567:security-group/sg-0954367191803e0a8" -> (known after apply)%0A      ~ id                     = "sg-0954367191803e0a8" -> (known after apply)%0A      ~ name                   = "terra-security-group" -> "edge-terra-security-group" # forces replacement%0A      + name_prefix            = (known after apply)%0A      ~ owner_id               = "788932519567" -> (known after apply)%0A        tags                   = {%0A            "Name" = "example-security-group"%0A        }%0A        # (6 unchanged attributes hidden)%0A    }%0A%0APlan: 1 to add, 0 to change, 1 to destroy.%0A%0AChanges to Outputs:%0A  ~ security_group_id = "sg-0954367191803e0a8" -> (known after apply)%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tfplan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tfplan"%0A
::debug::stderr: 
::debug::exitcode: 0
stdout<<ghadelimiter_6af95f1b-677d-4d6f-b51b-d0fd4c29d42f
aws_security_group.example: Refreshing state... [id=sg-0954367191803e0a8]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_security_group.example must be replaced
-/+ resource "aws_security_group" "example" {
      ~ arn                    = "arn:aws:ec2:us-east-1:788932519567:security-group/sg-0954367191803e0a8" -> (known after apply)
      ~ id                     = "sg-0954367191803e0a8" -> (known after apply)
      ~ name                   = "terra-security-group" -> "edge-terra-security-group" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "788932519567" -> (known after apply)
        tags                   = {
            "Name" = "example-security-group"
        }
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ security_group_id = "sg-0954367191803e0a8" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

ghadelimiter_6af95f1b-677d-4d6f-b51b-d0fd4c29d42f
stderr<<ghadelimiter_a3e7b344-2906-4381-8d73-d6cbfd8d5cb1

ghadelimiter_a3e7b344-2906-4381-8d73-d6cbfd8d5cb1
exitcode<<ghadelimiter_18b6b74f-e95f-4bb7-9019-c44daa6d6ab2
0
ghadelimiter_18b6b74f-e95f-4bb7-9019-c44daa6d6ab2
```

Plan saved to GitHub artifacts.